Tekla Open API Reference for Tekla Structures 2025
Plugin.SetAttribute Method
Overload List
Name | Description
SetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace